<?php

namespace Database\Seeders\seed;

use App\Models\Categories;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Storage;
use Illuminate\Support\Str;

class CategoriesSeeder extends Seeder
{

    protected array $category = [
        'Дитячий світ'              => [
            'Дитячий одяг',
            'Дитяче взуття',
            'Дитячі коляски',
            'Дитячі автокрісла',
            'Дитячі меблі',
            'Іграшки',
            'Дитячий транспорт',
            'Годування',
            'Товари для школярів',
            'Інші дитячі товари',
        ],
        'Нерухомість'               => [
            'Квартири',
            'Кімнати',
            'Будинки',
            'Земля',
            'Комерційна нерухомість',
            'Гаражі, парковки',
            'Подобова оренда житла',
            'Нерухомість за кордоном',
        ],
        'Авто'                      => [
            'Легкові автомобілі',
            'Вантажні автомобілі',
            'Автобуси',
            'Мото',
            'Спецтехніка',
            'Сільгосптехніка',
            'Водний транспорт',
            'Автомобілі з Польщі',
            'Причепи / будинки на колесах',
            'Вантажівки та спецтехніка з Польщі',
            'Інший транспорт',
        ],
        'Запчастини для транспорту' => [
            'Автозапчастини',
            'Аксесуари для авто',
            'Автозвук та мультимедіа',
            'Шини, диски і колеса',
            'GPS-навігатори / відеореєстратори',
            'Транспорт на запчастини / авторозбірки',
            'Мотозапчастини',
            'Мотоекіпірування',
            'Мотоаксесуари',
            'Мастила та автохімія',
            'Запчастини для іншої техніки',
        ],
        'Робота'                    => [
            'Роздрібна торгівля / продажі / закупки',
            'Логістика / Склад / Доставка',
            'Будівництво / облицювальні роботи',
            'Колл-центри / Телекомунікації',
            'Адміністративний персонал / HR / Секретаріат',
            'Охорона / безпека',
            'Клінінг / Домашній персонал',
            'Краса / фітнес / спорт',
            'Освіта / переклад',
            'Культура / мистецтво / розваги',
            'Медицина / фармацевтика',
            'IT / комп\'ютери',
            'Банки / фінанси / страхування / юриспруденція',
            'Нерухомість',
            'Реклама / дизайн / PR',
            'Виробництво / робітничі спеціальності',
            'Сільське і лісове господарство / агробізнес',
            'Часткова зайнятість',
            'Початок кар\'єри / Студенти',
            'Робота за кордоном',
            'Бухгалтерія',
            'Готельно-ресторанний бізнес / Туризм',
            'Інші сфери занять',
            'СТО / автомийки',
        ],
        'Тварини'                   => [
            'Собаки',
            'Коти',
            'Акваріумістика',
            'Пташки',
            'Гризуни',
            'Рептилії',
            'Сільгосп тварини',
            'Інші тварини',
            'Зоотовари',
            'В\'язка',
            'Бюро знахідок',
        ],
        'Дім і сад'                 => [
            'Канцтовари / витратні матеріали',
            'Меблі',
            'Продукти харчування / напої',
            'Сад / город',
            'Предмети інтер\'єру',
            'Будівництво / ремонт',
            'Інструменти',
            'Кімнатні рослини',
            'Посуд / кухонне приладдя',
            'Садовий інвентар',
            'Господарський інвентар / побутова хімія',
            'Інші товари для дому',
        ],
        'Електроніка'               => [
            'Телефони та аксесуари',
            'Комп\'ютери та комплектуючі',
            'Фото / відео',
            'Тв / відеотехніка',
            'Аудіотехніка',
            'Ігри та ігрові приставки',
            'Планшети / ел. книги та аксесуари',
            'Ноутбуки та аксесуари',
            'Техніка для дому',
            'Техніка для кухні',
            'Кліматичне обладнання',
            'Індивідуальний догляд',
            'Аксесуари й комплектуючі',
            'Інша електроніка',
            'Ремонт та обслуговування техніки',
            'в Бізнес та послуги',
        ],
        'Бізнес та послуги'         => [
            'Будівництво / ремонт / прибирання',
            'Фінансові послуги / партнерство',
            'Перевезення / транспортні послуги',
            'Реклама / поліграфія / маркетинг / інтернет',
            'Няні / доглядальниці',
            'Сировина / матеріали',
            'Краса / здоров\'я',
            'Обладнання',
            'Освіта / Спорт',
            'Послуги для тварин',
            'Продаж бізнесу',
            'Розваги / Мистецтво / Фото / Відео',
            'Туризм / іміграція',
            'Послуги перекладачів / набір тексту',
            'Авто / мото послуги',
            'Ремонт та обслуговування техніки',
            'Мережевий маркетинг',
            'Юридичні послуги',
            'Прокат товарів',
            'Інші послуги',
        ],
        'Мода і стиль'              => [
            'Жіночий одяг',
            'Жіноче взуття',
            'Чоловічий одяг',
            'Чоловіче взуття',
            'Жіноча білизна та купальники',
            'Чоловіча білизна та плавки',
            'Головні убори',
            'Для весілля',
            'Наручні годинники',
            'Аксесуари',
            'Одяг для вагітних',
            'Краса / здоров\'я',
            'Подарунки',
            'Спецодяг, спецвзуття та аксесуари',
            'Мода різне',
        ],
        'Хобі, відпочинок і спорт'  => [
            'Антикваріат / колекції',
            'Музичні інструменти',
            'Спорт / відпочинок',
            'Вело',
            'Мілітарія',
            'Квадрокоптери та аксесуари',
            'Книги / журнали',
            'CD / DVD / Платівки',
            'Квитки',
            'Пошук попутників',
            'Пошук гуртів / музикантів',
            'Інше',
        ]
    ];

    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        foreach ($this->category as $key => $value) {
            $category = Categories::query()->create([
                'name' => $key,
                'slug' => Str::slug($key),
                'description' => fake()->text(20),
                'image' => Storage::disk('public')->url('categories/' . $key . '.jpg'),
            ]);

            $subCategory = [];
            foreach ($value as $item) {
                $subCategory[] = [
                    'name' => $item,
                    'slug' => Str::slug($item),
                    'category_id' => $category->id,
                    'description' => fake()->text(20),
                    'image' => Storage::disk('public')->url('categories/' . $item . '.jpg'),
                ];
            }
            Categories::query()->insert($subCategory);
        }
    }
}
